app/views/users/_form.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---

      <% if User.find(session[:user_id]).permission_type == 'admin' %>