app/controllers/budget_subcategories_controller.rb

SELECT "budget_subcategories".* FROM "budget_subcategories"
---
     def index
          @budget_subcategories = BudgetSubcategory.all

INSERT INTO "budget_subcategories" ("committee_id", "subcategory_name", "subcategory_amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["committee_id", 1], ["subcategory_name", "sec food"], ["subcategory_amount", "10.0"], ["created_at", "2022-09-19 00:44:01.097293"], ["updated_at", "2022-09-19 00:44:01.097293"]]
---
     def create
          @budget_subcategory = BudgetSubcategory.new(budget_subcategory_params)

          respond_to do |format|
               if @budget_subcategory.save

UPDATE "budget_subcategories" SET "updated_at" = $1, "status" = $2 WHERE "budget_subcategories"."id" = $3  [["updated_at", "2022-09-19 01:14:34.419869"], ["status", "Pending"], ["id", 2]]
---
     def update
          respond_to do |format|
               if @budget_subcategory.update(budget_subcategory_params)

DELETE FROM "budget_subcategories" WHERE "budget_subcategories"."id" = $1  [["id", 1]]
---
     def destroy
          @budget_subcategory.destroy!

SELECT "budget_subcategories".* FROM "budget_subcategories" WHERE "budget_subcategories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
     def set_budget_subcategory
          #  User.find(session[:user_id]).committee_id
          @budget_subcategory = BudgetSubcategory.find(params[:id])