app/controllers/committees_controller.rb

SELECT "committees".* FROM "committees"
---
     def index
          @committees = Committee.all

INSERT INTO "committees" ("committee_name", "budget", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["committee_name", "sec"], ["budget", "12.0"], ["user_id", 1], ["created_at", "2022-09-19 00:42:38.120187"], ["updated_at", "2022-09-19 00:42:38.120187"]]
---
     def create
          @committee = Committee.new(committee_params)

          respond_to do |format|
               if @committee.save

SELECT "committees".* FROM "committees" WHERE "committees"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
     def set_committee
          @committee = Committee.find(params[:id])