app/controllers/requests_controller.rb

SELECT "requests".* FROM "requests"
---
     def index
          if session[:user_id]
               @user = User.find(session[:user_id])
               # check for proper permissions
               @requests = if @user.permission_type == 'admin'
                                Request.all

SELECT "requests".* FROM "requests" WHERE "requests"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
     def set_request
          @request = Request.find(params[:id])