app/controllers/users_controller.rb

     def index # ADMIN ONLY
          if session[:user_id]
               @user = User.find(session[:user_id])
               # check for proper permissions
               if (@user.permission_type == 'admin')
                    @users = User.all
---
SELECT "users".* FROM "users"

     def destroy
          @user = User.find(params[:id])
          @user.destroy
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]