app/controllers/users_controller.rb

     def create
          @user = User.new(user_params)
          if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "street_address", "city", "state", "zip_code", "uin", "email", "phone_number", "committee_id", "permission_type", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"

     def update
          respond_to do |format|
               if @user.update(user_params)
---
UPDATE "users" SET "updated_at" = $1, "password_digest" = $2 WHERE "users"."id" = $3  [["updated_at", "2022-09-19 01:58:37.386802"], ["password_digest", "$2a$12$4ae7IVwCCv/JgqcskSam3.mh4RZ5x0gBiEoi/W9lq7aydb32bVTAK"], ["id", 5]]